#+TITLE: 简明 OpenMP: 便捷的 C/C++ 并行计算
#+LANGUAGE: zh-CN
#+AUTHOR: [[https://github.com/shynur][/谢骐/]]
#+HTML_HEAD: <style> table, th, td {border: 1px solid;} </style>

本文使用的 OpenMP 版本为 \(4.5\), 机器的处理器个数为 \(16\).

*** [#B] 蒙特卡罗

#+BEGIN_SRC C++
  int in_circle = 0;
  constexpr int total = 10'0000;
  srand(total);
  #pragma omp parallel for
  for (int i = 0; i < total; ++i)
      if (double x = rand() / static_cast<double>(RAND_MAX),
                 y = rand() / static_cast<double>(RAND_MAX);
          x * x + y * y < 1)
  #pragma omp critical
          ++in_circle;
  cout << (4.0 * in_circle / total);
#+END_SRC

#+RESULTS:
: 3.11164

